<?php
/* ===================================================================
						(1) Определение констант :
=================================================================== */
define("DB_HOST", "localhost"); //для хранения адреса сервера баз данных mySQL
			//Простой пользователь (только SELECT)
define("DB_LOGIN_USER", "userConnect"); //для хранения логина для соединения с сервером баз данных mySQL
define("DB_PSW_USER", "QZSYPT4LyBr3vGcb"); //для хранения пароля для соединения с сервером баз данных mySQL
			//Администратор
define("DB_LOGIN_ADMIN", "adminConnect"); //для хранения логина для соединения с сервером баз данных mySQL
define("DB_PSW_ADMIN", "fJS4PHM6H8xfUjVA"); //для хранения пароля для соединения с сервером баз данных mySQL
define("DB_EBOOK", "e-book"); //для хранения имени базы данных
/* ===================================================================
						(2) Соединение с БД :
=================================================================== */
//1) Установка нового соединения с сервером MySQL
$mysqli = new mysqli(DB_HOST, DB_LOGIN_ADMIN, DB_PSW_ADMIN, DB_EBOOK); //Подключение к БД и обработка ошибок
if( $mysqli->connect_error ) {
    die( 'ERROR Connection! (' . $mysqli->connect_errno . ') ' . $mysqli->connect_error );
}
//2) Установка кодировки (на utf8) (можно и без)
if( !$mysqli->set_charset("utf8") ) {
    printf( "ERROR  load utf8: %s\n", $mysqli->error );
}
/* ===================================================================
						(3) Корзина покупателя :
=================================================================== */
//вычисление кол-ва товара в корзине
if( isset( $_SESSION["BasketArrSize"] ) ) { //Если установлена сессия с данными (с значением числа товара в корзине)
	$count = $_SESSION["BasketArrSize"]; //берем данные из этой переменной (и сохр. в переменной)
} else { //если массива еще нет
	$count = 0;
}